[
    {
        "id": 1,
        "name": "Campo Minado",
        "description": "Projeto que foi desenvolvido em Java com o objetivo de estudar conceitos básicos de programação enquanto simula o famoso jogo do Windows. O jogo conta com 3 níveis de dificuldades em que a quantidade de bombas disponíveis varia de acordo com o nível e possui com 3 tipos diferentes de ações: Revelar, Marcar e Desmarcar.",
        "image": "/assets/projects/campoMinado.PNG",
        "link": "https://github.com/RaphaelO-Melo/P03-Minesweeper",
        "institution": 1,
        "tools": [1]
    },
    {
        "id": 2,
        "name": "Estação de Bombeiros",
        "description": "Projeto desenvolvido em Java com o objetivo de exercitar lógica de programação. O algoritmo tem como objetivo encontrar todas as rotas possíveis até um incêndio em um grafo que é representado por um arquivo de texto. Nesse arquivo o usuário informa qual a posição em que se encontra o incêndio e em seguida as ligações existentes entre cada um dos grafos.",
        "image": "/assets/projects/bombeiros.PNG",
        "link": "https://github.com/RaphaelO-Melo/P04-Fire-Station",
        "institution": 1,
        "tools": [1]
    },
    {
        "id": 3,
        "name": "Simulador de Memória",
        "description": "Projeto desenvolvido em Java com o objetivo de aprimorar as habilidades em lógica de programação. O programa simula a alocação de memória no Windows alocando pedaços da memória com endereço e tamanhos de blocos. As operações que podem ser realizadas pelo usuário são: alocar memória para execução de processo, finalizar processo e visualizar o status atual da memória.",
        "image": "/assets/projects/memorySimulator.PNG",
        "link": "https://github.com/RaphaelO-Melo/P05-MemorySimulator",
        "institution": 1,
        "tools": [1]
    },
    {
        "id": 4,
        "name": "Into the Dwarfness",
        "description": "Jogo desenvolvido em Java com o objetivo de exercitar as hablidades em Programação Orientada a Objetos. No jogo o usuário controla uma anão através de 5 fases enquanto explora uma caverna. Ao longo do caminho o usuário enfrenta vários inimigos controlados por uma inteligência artificial que tem como base o algoritmo A* com quem pode batalhar para garantir sua sobrevivência.",
        "image": "/assets/projects/intoTheDwarfness.PNG",
        "link": "https://github.com/Waffliors/Into-The-Dwarfness",
        "institution": 1,
        "tools": [1]
    },
    {
        "id": 5,
        "name": "Quests of Wisllow",
        "description": "Projeto de conclusão de curso desenvolvido em Unity utilizando C#. No jogo o usuário controla Andrew, um jovem gamer que foi sequestrado por um mago misterioso e agora para poder escapar, ele deve completar três tarefas. O projeto une todas as habilidades adquiridas ao longo da graduação em jogos digitas como por exemplo algoritmos, inteligência artificial, game design e gestão de projetos.",
        "image": "/assets/projects/questsOfWisllow.PNG",
        "link": "https://play.google.com/store/apps/details?id=com.Bugnatron.QuestsofWisllow",
        "institution": 1,
        "tools": [5, 6]
    },
    {
        "id": 6,
        "name": "UNES",
        "description": "Site desenvolvido para estudar os conceitos básicos de HTML5. O projeto simula a página de uma universidade de tecnologia fictícia e conta com três páginas. No projeto foi possível ter contato com a estruturação básica de uma página web, paginação, uso de links, uso de imagens e a estrutura básica de um formulário.",
        "image": "/assets/projects/unes.PNG",
        "link": "https://github.com/RaphaelO-Melo/Site_UNES",
        "institution": 4,
        "tools": [2]
    },
    {
        "id": 7,
        "name": "Modelo Anna",
        "description": "Site desenvolvido para estudar os conceitos básicos de CSS3. O projeto simula um portfólio de uma modelo e conta com quatro páginas. No projeto foi possível ter contato com a manipulação de fontes, cores, e dimensões além de estilização através de elementos, ids e classes.",
        "image": "/assets/projects/anna.PNG",
        "link": "https://github.com/RaphaelO-Melo/Site_Modelo-Anna",
        "institution": 4,
        "tools": [2, 3]
    },
    {
        "id": 8,
        "name": "TecBlog",
        "description": "Site desenvolvido para estudar conceitos básicos de CSS3. O projeto simula um blog de tecnologia que aborta tópicos diversos como jogos, informática e eletrônicos. O projeto conta com cinco páginas e teve como objetivo reforçar conceitos básicos de CSS3, porém com um volume maior de elementos para serem estilizados.",
        "image": "/assets/projects/tecblog.PNG",
        "link": "https://github.com/RaphaelO-Melo/Site_TecBlog",
        "institution": 4,
        "tools": [2, 3]
    },
    {
        "id": 9,
        "name": "Notícias Cidade",
        "description": "Site desenvolvido para estudar conceitos intermediários de CSS3. O projeto simula um portal de notícias de uma pequena cidade. Ele conta com sete páginas principais e diversas páginas para cada uma das notícias onde foi exercitada a estilização em cascata e a introdução ao conceito de layout fluido.",
        "image": "/assets/projects/noticiasCidade.PNG",
        "link": "https://github.com/RaphaelO-Melo/Site_Noticias-Cidade",
        "institution": 4,
        "tools": [2, 3]
    },
    {
        "id": 10,
        "name": "Chalé hotel",
        "description": "Site desenvolvido para estudar conceitos intermediários de CSS3. O projeto simula o portal de um hotel e tem como objetivo exercitar conceitos como o posicionamento de elementos e a fluidez de layout.",
        "image": "/assets/projects/chaleHotel.PNG",
        "link": "https://github.com/RaphaelO-Melo/Site_Chale-Hotel",
        "institution": 4,
        "tools": [2, 3]
    },
    {
        "id": 11,
        "name": "Museu Nacional",
        "description": "Site desenvolvido para estudar tags modernas do HTML5. O projeto simula a home page do portal do museu nacional e tem como objetivo exercitar o uso de tags modernas do HTML como section, article, aside e nav.",
        "image": "/assets/projects/museuNacional.PNG",
        "link": "https://github.com/RaphaelO-Melo/Site_Museu-Nacional",
        "institution": 4,
        "tools": [2, 3]
    },
    {
        "id": 12,
        "name": "Finans",
        "description": "Site desenvolvido para estudar conceitos básicos do Bootstrap 4. O projeto simula uma ferramenta de finanças pessoais e tem como objetivo explorar os conceitos básicos do bootstrap como cores, grid e componentes. Também foi introduzido o conceito de breakpoints e responsividade de maneira mais precisa.",
        "image": "/assets/projects/finans.PNG",
        "link": "https://github.com/RaphaelO-Melo/Site_Finans",
        "institution": 4,
        "tools": [2, 3, 7]
    },
    {
        "id": 13,
        "name": "Spotify",
        "description": "Projeto desenvolvido para estudar conceitos intermediários do Bootstrap4. O projeto simula a homepage do Spotify e tem como objetivo explorar o uso de ferramentas bootstrap como posicionamento, menus e carousel ainda aprimorando os conhecimentos sobre responsividade.",
        "image": "/assets/projects/spotify.PNG",
        "link": "https://github.com/RaphaelO-Melo/Site_Spotify",
        "institution": 4,
        "tools": [2, 3, 7]
    },
    {
        "id": 14,
        "name": "Calculadora",
        "description": "Projeto desenvolvido para estudar conceitos básicos de Javascript. A aplicação simula uma calculadora que realiza as 4 operações aritméticas fundamentais (adição, subtração, multiplicação e divisão). Com o projeto foi possível ter um contato inicial com javascript explorando seus fundamentos, como variáveis, funções e manipulação do DOM.",
        "image": "/assets/projects/calculadora.PNG",
        "link": "https://github.com/RaphaelO-Melo/APP_Calculadora",
        "institution": 4,
        "tools": [2, 3, 4, 7]
    },
    {
        "id": 15,
        "name": "Game Mata Mosquito",
        "description": "Projeto desenvolvido para estudar conceitos básicos de Javascript. No jogo, o usuário controla uma raquete e 3 níveis de dificuldade disponíveis e tem como objetivo acertar todos os motivos que aparecem na tela ao clicar em cima deles. Caso o jogador deixe 3 mosquitos escaparem, ele perde o jogo. O projeto teve como objetivo exercitar conceitos básicos de Javascript, como eventos, redimensionamento de tela e cronômetros.",
        "image": "/assets/projects/mataMosquito.PNG",
        "link": "https://github.com/RaphaelO-Melo/APP_Game-mata-mosquito",
        "institution": 4,
        "tools": [2, 3, 4, 7]
    },
    {
        "id": 16,
        "name": "Alura Studies",
        "description": "Projeto desenvolvido para estudar conceitos básicos de React com Typescript. A aplicação simula um controlador de estudos onde o usuário pode cadastrar tarefas e definir quanto tempo ela levará. Após o cadastro o usuário pode iniciar a atividade e acompanhar o tempo restante através do contador. O projeto tem como objetivo exercitar conceitos básicos do React como components, props, states e controles de inputs além de conhecer também o Typescript e o SASS.",
        "image": "/assets/projects/aluraStudies.PNG",
        "link": "https://github.com/RaphaelO-Melo/Alura-Studies",
        "institution": 5,
        "tools": [2, 3, 8, 9, 10]
    },
    {
        "id": 17,
        "name": "Aluroni",
        "description": "Projeto desenvolvido para estudar conceitos básicos de React com Typescript e conhecer a Biblioteca React Router. A aplicação simula o site de um restaurante italiano onde o usuário pode pesquisar pelos pratos, selecionar por filtros e ordenar os pratos pelas suas características. O projeto tem como objetivo estudar conceitos básicos de React como lidar com arquivos estáticos, menus de navegação e filtros através da manipulação de states. Durante o desenvolvimento do site também foi possível aprofundar os conhecimentos em SASS e conhecer a biblioteca React Router e a ferramente ESLint.",
        "image": "/assets/projects/aluroni.PNG",
        "link": "https://github.com/RaphaelO-Melo/Aluroni",
        "institution": 5,
        "tools": [2, 3, 8, 9, 10]
    },
    {
        "id": 18,
        "name": "Doguito Petshop",
        "description": "Projeto desenvolvido para estudar conceitos básicos de React e a estrutura de uma SPA. O projeto simula um blog de um petshop onde o usuário pode flitar os posts por categorias e subcategorias. O principal objetivo do projeto foi exercitar os conhecimentos da estrutura de uma SPA como, por exemplo rotas exatas, rotas aninhadas, páginas 404 e barras de navegação.",
        "image": "/assets/projects/doguito.PNG",
        "link": "https://github.com/RaphaelO-Melo/DoguitoPetshop",
        "institution": 5,
        "tools": [2, 3, 8]
    },
    {
        "id": 19,
        "name": "Event Tracker",
        "description": "Projeto desenvolvido para estudar o controle de estados globais no React. A aplicação simula uma agenda onde o usuário pode adicionar eventos em datas customizadas, pesquisar pelos eventos criados e também marca-los como concluídos ou até mesmo removê-los da lista. O objetivo principal do projeto é entender a importância de gerir estados de forma global e evitar o prop drilling. Para isso são usados a biblioteca Recoil e Hooks customizados.",
        "image": "/assets/projects/eventTracker.PNG",
        "link": "https://github.com/RaphaelO-Melo/EventTracker",
        "institution": 5,
        "tools": [2, 3, 8, 9, 10]
    },
    {
        "id": 20,
        "name": "React Context",
        "description": "Projeto desenvolvido para estudar o controle de estados globais no React. A aplicação simula um marketplace onde o usuário pode comprar produtos orgânicos através de um saldo inicial. O usuário pode adicionar e remover os produtos do carrinho e ao chegar ao checkout seleciona os meios de pagamentos disponíveis onde são aplicados os juros. O objetivo principal é aprimorar o conhecimento em estados globais no React através do uso de contextos com Context API.",
        "image": "/assets/projects/reactContext.PNG",
        "link": "https://github.com/RaphaelO-Melo/ReactContext",
        "institution": 5,
        "tools": [2, 3, 8]
    }
]